<?php
/**
 * Created by PhpStorm.
 * User: LCF
 * Date: 2019/1/20
 * Time: 0:04
 */

$strs=<<<DDDD

1、 一客户打电话申请支付卡，男友在核对客户姓名时问：“请问您名字怎么写的？”客户毫不犹豫地回答：“用笔写的！”

2、 湖边，一个画家正在画画，身后来了一男一女。他们看了一会儿，最后女友以无可辩驳的口吻对男友说：“看见了吧，亲爱的，不买一个相机，该有多苦恼哇！”

3、 小蚯蚓在做数学，要用小棍子计数，发现棍子不够用。小蚯蚓叫：“爸爸，给我找二十根棍子来。”蚯蚓爸爸拿起一把刀，把自己切成了二十段，然后弱弱地说道：“拿去用吧，不够再切你妈妈。”

4、 有次在办公室喝水，突然前面坐的妹子说我给咱唱一首上海滩吧，大家都没吱声当默许了…妹子开唱了：裸奔，裸跑，裸奔裸跑对身体不好…顿时一口水喷到电脑屏幕上，毁三观的上海滩啊…

5、 “太了不起了！”一名秃头男子站在镜子前对儿子说。“你在说谁啊？”儿子惊奇地问。“当然是你啦老爸。你看我这把年纪了，都没一根白发。。。”

6、 上街买瓷器，看到一个白碗特有个性，就买了，临走问老板：“能放锅里蒸吗？”老板一惊，然后看着我说：“我想应该可以，不过这是个花盆。”

7、 男友过两天要坐飞机回趟老家，跟未婚妻说：要是我死了你就再找个吧，你还年轻，别为我守寡了。未婚妻含泪点点头：你放心吧，我都找好了，就等你……

8、 我一同学旧手表坏了，他满心欢喜地想让他爸给他买一个新的，打通电话后他说：“爸，我的手表坏了！”只听他爸洪亮地回答：“现在9点半！”

9、 甲：“请我吃饭要至少提前三天预约”乙羡慕地说道：“哇！没想到你的应酬还蛮多的！”甲：“不是，我饿三天才能吃得多呀！”

10、 澡堂里，一男的对他朋友说，看那个人的瓶子是妇炎洁，一个男人带这玩意来洗澡真丢人。他朋友问，你怎么知道？答曰，我用十几年了，一看瓶盖就知道。

11、 据新华社报道，成都一用户在查看短信时被电流击倒致昏迷，经查是衣服静电所致，专家提醒您查看短信时先把衣服脱光，一丝不挂，以免发生危险。哈哈！

12、 老婆坐月子不能下床，我是细心地照顾，体贴入微，老婆感动的不得了说：“等你全身瘫痪了，我也伺候你！”我真特么感动啊……

13、 记得幼儿园的时候，我和两个女孩玩过家家。我说：“我要做爸爸！”一女孩儿说：“我要做妈妈！”另一个女孩儿害羞道：“那...那我只好做小三了！

14、 深夜两点，醉醺醺的男友才回家。妻子怒：我一再告诉你，喝酒不能超过两瓶，回家不能超过十点，你敢不听我的？男友：我记反了。

15、 女友要路考了，她刚坐进车，我就递给考官500块。他说：“抱歉，先生，我不收贿的。”我说，“不，不是贿赂，这是修车费。”

16、 早上女友及其两同事买了包子要用微波炉热着吃，结果三个人讨论了半天到底是要调中火还是中高火，到时间“叮”一声，三人打开微波炉一看，结果包子忘记放进去了。

17、 "一天，一牙签和女友在路上散步，看见一刺猥。连忙说了句：“公交车,停一下!”刺猥说：“对不起，车上乘客满了，你们坐下一趟吧。”"

18、 昨天一家4口外面吃饭，结帐255块，我自言自语：霍，差点就250了，找老板娘要了发票一刮奖，我擦，中了5块！！！老板娘碎碎念了一句，这回真是250了。。。

19、 男友在联通上班，一天接到电话：喂？您好，是电话局吗？是这样的，我这边电话线太长了哎，你们那头能不能拉过去一点？

20、 那日微信上，我对一陌生MM发消息：“美女，出来玩不？” “有病！” “那算了，祝早日康复！”

21、 大学时候，一个宿舍女同学长相一般，天天在宿舍照镜子说：唉，天天一大群男的像苍蝇一样围着我转、烦死了。上铺终于受不了说：大概是因为你像大便吧！

22、 一罪犯即将被枪毙，但子弹质量不是很好，第一枪执行者放了空枪，接着第二枪，熄火了，第三枪，罪犯哭着说，大哥你掐死我吧，太吓人了。

23、 爷爷：小明，你要好好学，不然……小明：不然就娶不到好老婆。爷爷：谁告诉你的？小明：爸爸。爷爷：傻孩子，不仅是娶不到好老婆，还会生个笨儿子。

24、 肚子疼上厕所，酝酿了半天嘣的放了个屁。完事后冲水准备走人，隔壁来了一句：“哥们儿，还有纸么？刚被你一吓，纸掉坑里了。

25、 一只小鸡问牛：主人呢？牛：出去买蘑菇了。小鸡听了撒丫子就跑。牛说，你跑什么？小鸡：有本事主人买土豆的时候你小子别跑！

26、 大夫问：“小姐！你怎么了？哪里不舒服？我帮你看看！”小姐回：“我没事！是我孩子有病要看医生！可我把孩子放在家里忘了带出来了”

27、 我家有很多动画光碟，可是不好管理，所以我在上面上标上A、B、C、D……一天儿子嚷着要放动画光碟，我问他：想看哪部片子？儿子利落地说：A片！

28、 和老公说我今年过年不准备买新衣服了！要省钱！老公瞥了我一眼道：“亲爱的，还是买衣服吧！这样起码我能知道钱花在哪儿了！”(www.siandian.com 闪点情话网)

29、 等车的时候太冷，男友就左晃右晃的，我说：“你是QQ啊？”他说嗯啊。然后过了好久，他咳了两下，我问：“感冒啦？”他说我是QQ啊。过了一会我才反应过来：这是要加我为好友。

30、 你那样喜欢吹嘘自己，他女友很不耐烦。有一天，男友正在向人们吹自己是武术冠军时，他女友从背后一个扫堂腿，把他撂了个仰八叉。男友说：这位是我的教练。

31、 要省钱，必须得学会杀价！比如买一个标价1000元的东西，一定要装出满不在乎的样子。然后还价只愿出20块钱才肯买，这时老板会肯定会说：滚！你赶紧滚，钱就这样省下来了!!

32、 男友约女友看电影，可她一直在屋里化妆不肯出来。等她出来后，发现男友在悠闲地看报纸，不解：“你咋不催我？”男友笑：“没事，我刚看完电影回来。”

33、 女友：“你真的要在这里用餐吗？这家餐厅的价格贵得吓人。”男友：“有多贵。”女友：“贵到你连没喝完的水都想打包带回家。”

34、 下午和老婆在床上打着玩，老婆假装要把我踹下床，被三岁女儿看到了，义愤填膺的对说：“走爸爸，妈妈不让你睡她床 ，我带你去小姨床上睡！！！”

35、 萤火虫到动物园参观，被猴子发现了，追了他一个晚上。萤火虫：我说猴子，你老追我干嘛？猴子：你丫以为我想追你啊？我追的是你屁股上的火！

36、 趁同学洗澡去，把他手机里女友的号码改成我的。晚上躺床上给他发一条短信“老公，我怀孕了”。只见那哥们忽的翻身下床，巴达巴达抽了一盒烟，找寝室人借钱…

37、 邻家小女孩干了坏事，妈妈生气不理她了。爸爸告诉她：快去认错吧。她就对妈妈说：你是不是范冰冰？妈妈莫名其妙：啥？女孩道：对不起，我认错了。

38、 面试时考官问我：“能否说一说你有什么长处？”“我是一个思想积极、乐观向上的人。”“哦？能举个例子吗？”“当然可以！我什么时候开始上班？”

39、 小学时，正逢上自然课，老师讲到“杠杆原理”，启发大家：“除了铁棍、木棍，还有什么可以做杠杆？”大家七嘴八舌中突然夹杂一声：“还有光棍！”

40、 这是一通宠物食品的电话市场调查，接电话的是一个小朋友。 市调员：“小朋友，你家里有没有养小狗、小猫、小兔子或是小鸟？”小孩：“没有，我妈妈都没有生。”市调员：“......”。

41、 我问女同事：为什么说屌丝不是没有吸引妹子的能力，而是善于把煮熟的鸭子弄飞？她说：今晚来我家玩，我再告诉你。我：你先给我解释！她：就是这样！

42、 老公：“我失眠。”老婆：“我也失眠。”老公：“一只羊、两只羊、三只羊……”老婆：“一件貂皮大衣、两件貂皮大衣、三件貂皮大衣……”

43、 甲说：“今天跟老外PK英语，打了个平手！”乙听后佩服地说：“这么牛？”甲淡定地说道：“他听不懂我的，我也听不懂他的。”B：……

44、 小时被妈妈打，我就哭，妈妈说不准哭，再哭还打。有次妈妈又打我，我为了少受皮肉之苦，就硬忍着不哭，结果我妈妈说脾气还挺倔，然后又把我打哭了。

45、 Ａ：“你为什么这么努力学习？”Ｂ：“因为我太爱我女友了。”Ａ：“就因为这个？”Ｂ：“我女朋友是个吃货，我害怕她以后吃不到好吃的。”

46、 女友胃口太好真是件让人苦恼的事。每次问她要不要盛饭时她朝我比个ＯＫ的手势，我都分不清到底是“ｏｋ”还是“３碗”

47、 今天看见一个女的追男的，超可爱，她说：“做我男友吧，行不行？行就行，不行我再想想办法。”

48、 男友：“我打算戒酒。”女友：“这话我都听腻了。”男友：“不信？我敢给你赌两瓶‘二锅头’。”

49、 男友：”丽丽结婚了。”女友：“和谁结婚？”男友：“就是给她做透视的那位调光专家。”女友：“她为什么会和他结婚呢？”男友：“由于除了他以外，谁也无法了解她的心。”

50、 女友对吝啬鬼男友大叫道：“和你这个守财奴在一起简直受够啦，这是你给我的项链，拿去吧！”男的伸手接过项链，说：“盒子呢？”

51、 女友发短信说：“亲爱的，我爱你！”我回短信：“亲爱的，我和你的想法一样。”女友：“一样的想法是什么想法？”我回短信：“我也爱我自己。”女友：“滚！”

52、 男友睡不着，女友问他怎么了？男友说：今天老板请他们喝了咖啡。女友说：明晓得喝了咖啡睡不着，干吗还喝？男友说：不要钱的东西不喝，一样睡不着。

53、 乘客A：现在的商家越来越有头脑了，直接让商品自己说话。乘客B：怎么说话？乘客A：菜市场大鸡笼，鸡脖子上挂着一个牌子，上面写着：我是农村来的。

54、 老婆用电脑看电视剧，我玩手机。老婆突然问：如果我失忆了，忘了你怎么办？我随口一说“那还不好”空气瞬间变冷，我抬头认真地看着她：我再追你一回。

55、 上高二时班后面几乎天天缺人，老师发火了说一定要严惩不贷，突然老师手机响了，拿出一看直接扔讲桌上：谁把信息发我手机上了，还“老班”发火快回来。

56、 洗车店老板问银行行长：银行怎么赚钱？行长：授信类业务、中间业务和资产类业务。老板：能说的简明点吗？行长：就是高利贷、乱收费，外加拉皮条。

57、 今天坐出租车去上班，司机师傅连闯了五个红灯，我见这架势，便问司机师傅：“你不怕违章啊？”司机师傅说：“明天就辞职了！”

58、 你不学数学，你在买菜时就不能用线性规划计算出最优方案了！！！你不学数学，你就不能在打排球时用二次函数计算出球的落地位置了！！！你不学数学，你连四娘、何炅、姚明能不能围成一个三角形都不知道。。。

59、 一同学，刚做警察。有次出外勤，去抓人，这哥们发了条微博说“我们在伏击”，结果这条微博被好多人转了，警局领导也知道了，结果他就被请进去喝茶了，原因是向犯罪分子通风报信…

60、 某天晚上想买零食吃，老妈制止，问我：“你不减肥了？”我说：“嗨…反正我有男朋友，有人要了…”然后妈妈看着我，说了句特励志的话：“不想换了？”

61、 有一次坐公共汽车，人非常多，男友就随便扶着一根金属竖杆。很多人都下车了，他才发现，他一直扶着的是一个金属杆的拖把。一个妇女一手拿着拖把，一手抱着小孩，对他瞪着眼睛。

62、 女友给我发短信，说：今晚来我家吧，我家没人。于是我去敲门，敲了一小时，果然没人。

63、 在亿万富翁的丧仪上来了许多人，男友哭得死去活来。“想开点吧！”不明真相的人们安慰他，“故去的是您的父亲吗？”“不是，”男友哭得更厉害了，“为什么他不是我的父亲啊……”

64、 今天和女友去银行取钱，她正在取，我在旁边看到一个意见薄，就随手拿过来翻了一下。只看到第一页赫然用指甲掐出了几个大字：为什么没有笔……

65、 今天跟男友吃饭，他估计吃多了，在公交车上忍不住连着打了三个嗝：“呃～呃～呃～”旁边座上一个小盆友，坐在妈妈腿上，奶声奶气接了句：“曲项向天歌～”

66、 还有一个多月就是清明假期了，女友在外地上学，给我写了一封信，开头是这样说的：“亲爱的，清明节快到了，我们见面的日子不远了。”

67、 今天二货妹妹给我打电话：哥，我感冒了 我：吃药没？ 她：没有 我：咋不吃？ 她：不饿！

68、 两个发小，甲和乙，后来反目成仇。 甲对乙说：你忘了咱俩从小撒尿和泥的交情了吗？ 谁知乙恶狠狠的说：我永远也忘不了，每次都是你尿尿，我和泥！

69、 老爸说给我买了辆车，我准备开出去兜风的， 出门是老爸说“车钥匙拿去”。 当时我那个激动啊。一看是拖拉机的摇把子！！！

70、 女：明天你请假陪我去逛街吧，男：请不到。”女：那你就说你叔叔死了啊！男恼火地说：上次为了陪你，我舅舅已经死过两回了，照这样下去我们俩谈成了，我家亲戚也死光了

71、 有一次我问我同桌：“你的男友长啥样啊？”我同桌很随意的说：“能啥样啊，就长了俩鼻子一个眼。”我：“你确定么.............”

72、 A:去年香飘飘奶茶卖出7亿多杯绕地球三圈，今年卖出10亿多杯为什么还是绕地球三圈啊？ B:奸商！杯子小了

73、 老公正在给我剪脚指甲，老公：“为什么大拇指刚剪过” 答：“昨天想剪，突然想起来你今天回来就都留给你了” 老公：“你真疼我！

74、 牧师的女儿在楼上睡觉，哭了，牧师上楼问她为何哭。 “爸爸，我怕。” “不怕，小宝贝。上帝和你在一起。” “爸爸，你来跟上帝在一起吧，我下去跟妈妈在一起，好不好？”

75、 女儿：“爸爸，什么是海啸呢？”爸爸：“爸爸不是带你去看过大海吗？海啸就是大海来看我们。。。”

76、 女市长和男书记共同赴宴，席间高兴之余，书记说：书记一般都干过市长！女市长机灵地应答：是的，书记一般是市长生（升）的！

77、 男友去喝喜酒，席间突然停电。大家担心有人偷吃菜，于是都建议拍手唱歌。正在拍手时电突然来了，大家一看，一人正在一手夹菜一手打自己耳光。

78、 公共汽车上拥挤不堪，一位乘客对售票员说：“你先别关门，我老婆和孩子还没上来。”“没关系，你先回家做饭。”售票员说

79、 女友：亲爱的，只要你把面包和咖啡准备好就可以吃早餐啦！男友：今天早上吃什么呢？女友：面包和咖啡

80、 问：都大三了还没女朋友，怎么办！答：针对这个问题，我们团队中，都大爷了还没女友的数位科学家表示：“这事儿不急。”

81、 男友去喝喜酒，席间突然停电。大家担心有人偷吃菜，于是都建议拍手唱歌。正在拍手时电突然来了，大家一看，一人正在一手夹菜一手打自己耳光

82、 男友去披萨店买披萨！服务员问我是要切成8块还是12块？他想了想说：还是8块吧？12块吃不完

83、 看球赛，曼联赢了一场比赛，乐得我手舞足蹈，女友很不理解地说：“干吗呀？至于么？”我说：“我兴（姓）奋！”女友毫无表情地看了看我说：“什么时候改姓了？”

84、 女友：“听说你在看精神病医生，你觉得对你有没有帮助？”男友：“当然有。以前，电话响我不敢接。现在，电话响不响我都去接。

85、 俺爸妈吵架，其实就是斗嘴。妈：你打着灯笼都找不着比我更好的了。爸：我就是打着灯笼找的你。老妈听了之后乐的不行，然后，爸：就是我没睁眼。

86、 老师：我们学习了安全知识，现在来考查，家里煤气泄漏了怎么办。 学生：赶紧把门窗关好，可别让邻居占了便宜。

87、 啤酒说:＂喝我的人一般都浪漫!＂白酒说:＂喝我的人一般都豪爽!＂红酒说:＂喝我的人一般都有钱!＂酒精说:＂没有我，你们都成了水货!＂

88、 公猫风流成性，屡招母猫在家制造噪音，主人怒，将其阉割。清净仅数日，家中又现众多猫咪“联欢”。主人大惊：难道没阉干净？公猫叹：不能亲自奋战在第一线了，办办培训班指点一下，总可以吧？

89、 学长骑自行车载一学妹回家， 到了家学妹下车羞涩地说：“学长，以后你车的后座能只属于我么？” 说完脸红的低下了头，学长顿时愣了下， 随即笑了说：“没问题，我今晚回家拆给你…”

90、 一对情侣在公园里接吻，旁边一小孩一直看一直看，然后这男的说：小朋友我给你一元钱去买东西吃，别看了好吗？这孩子随手从兜里拿出一元钱说：我给你一元钱，你再让我看会行吗？

91、 女友：好多男人越来越不象话了，竟然用老婆作赌注。男友：是的。女友：结婚以后你不会也这样对我吧？男友：当然不会……不值钱的东西怎么可以？

92、 老师：“什么叫‘调虎离山’？” 学生：“譬如考试的时候，校长忽然把老师从教室叫了出去，这就叫做‘调虎离山’。”

93、 一舍友跟朋友聊天，那个朋友说，“我家就只有我一个还没结婚，我奶奶都着急了，”二逼舍友回了一句，“你奶奶是急着抱孙子了吧。”那个朋友无语了，“我就是孙子好不好。。。

94、 丈夫驾车出门，妻子在家听广播。听到一则报道，妻子连忙拿起电话：“老公啊，我刚听广播上说，高速公路上有一辆车在逆行，你千万要小心啊！”老公：“哪是一辆啊？我看有好几百辆车都在逆行！”

95、 丈夫下班回家，见妻子把长发剪成了短发，不高兴地说：“挺好的长头发干吗剪得这么短？怎么也不跟我商量商量。”妻子说：“你的头顶都秃成什么样子了，跟我商量过吗？”

96、 一天，汤姆在步行去上班的途中，被一辆汽车撞倒了。事故并不严重，司机道过歉后，又补了一句：“你真走运。旁边就有一家诊所。”汤姆回答道：“我就是那家诊所的医生。

97、 寒假期间，几个人到一同事家搓麻，刚进屋，同事女友眼巴巴望着那同事说：我想吃西瓜。同事回：别客气，随便想。

98、 一对情侣，女友可怜巴巴地问道：“我们为什么不能住贵一点的房子？”男说：“我们马上就要住贵房子了。房东说明天起给我们加房租。”

99、 一个男子挣了很多钱，但是都给了妻子。后来离异，他身无分文。谈恋爱后，女友责怪他说：“一个大男人怎么可以不留一点儿私房钱？”男子听了，诚恳地说：“你说得对，我以后一定改。”

100、 女友：“你看那谁谁谁，又高又帅脾气又好又能挣钱又疼老婆，会炒一手好菜还爱干净。再看看你。。。”男友听完后一脸陶醉：“你问他喜欢男的不？”


DDDD;

//$strs=strip($tt);

include dirs().'/bom_head.php';

//$strs="left:0px;top:202px;width:90px;height:30px";
//echo preg_replace("/[0-9]||、/","",$strs);

function strip($str)
{
    $str=str_replace("<br>","",$str);
//$str=htmlspecialchars($str);
    return strip_tags($str);
}

/**
 * @return mixed
 * @date
 * @user LCF
 * @功能
 */
function dirs(){
    return getcwd();
}